microproyecto-2/app/artillery.yml
config:
  target: "http://4.239.148.95"
  
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Round 1"
      
    # - duration: 10
    #   arrivalRate: 2
    #   rampTo: 10
    #   name: "Round 2"
      
    # - duration: 10
    #   arrivalRate: 5
    #   name: "Round 3"

  engines:
    http: {}

scenarios:
  - name: "Prueba de predicción de imagen"
    flow:
      - post:
          url: "/predict"
          formData:
            img:
              fromFile: "./horse.jpg"